MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128L.atdf
      <value-group caption="JTAG Enable bit" name="DEVCFG0__JTAGEN">
         <value caption="JTAG Port Enabled" name="ON" value="0x1" />
         <value caption="JTAG Disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="PGEC1/PGED1 pair is used" name="ICS_PGx1" value="0x3" />
         <value caption="PGEC2/PGED2 pair is used" name="ICS_PGx2" value="0x2" />
         <value caption="PGEC3/PGED3 pair is used" name="ICS_PGx3" value="0x1" />
         <value caption="Reserved" name="Reserved" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Write-Protect bits" name="DEVCFG0__PWP">
         <value caption="Disabled" name="OFF" value="0x3ff" />
         <value caption="Memory below 0x400 address is write-protected" name="PWP1K" value="0x3fe" />
         <value caption="Memory below 0x800 address is write-protected" name="PWP2K" value="0x3fd" />
         <value caption="Memory below 0xC00 address is write-protected" name="PWP3K" value="0x3fc" />
         <value caption="Memory below 0x1000 address is write-protected" name="PWP4K" value="0x3fb" />
         <value caption="Memory below 0x1400 address is write-protected" name="PWP5K" value="0x3fa" />
         <value caption="Memory below 0x1800 address is write-protected" name="PWP6K" value="0x3f9" />
         <value caption="Memory below 0x1C00 address is write-protected" name="PWP7K" value="0x3f8" />
         <value caption="Memory below 0x2000 address is write-protected" name="PWP8K" value="0x3f7" />
         <value caption="Memory below 0x2400 address is write-protected" name="PWP9K" value="0x3f6" />
         <value caption="Memory below 0x2800 address is write-protected" name="PWP10K" value="0x3f5" />
         <value caption="Memory below 0x2C00 address is write-protected" name="PWP11K" value="0x3f4" />
         <value caption="Memory below 0x3000 address is write-protected" name="PWP12K" value="0x3f3" />
         <value caption="Memory below 0x3400 address is write-protected" name="PWP13K" value="0x3f2" />
         <value caption="Memory below 0x3800 address is write-protected" name="PWP14K" value="0x3f1" />
         <value caption="Memory below 0x3C00 address is write-protected" name="PWP15K" value="0x3f0" />
         <value caption="Memory below 0x4000 address is write-protected" name="PWP16K" value="0x3ef" />
         <value caption="Memory below 0x4400 address is write-protected" name="PWP17K" value="0x3ee" />
         <value caption="Memory below 0x4800 address is write-protected" name="PWP18K" value="0x3ed" />
         <value caption="Memory below 0x4C00 address is write-protected" name="PWP19K" value="0x3ec" />
         <value caption="Memory below 0x5000 address is write-protected" name="PWP20K" value="0x3eb" />
         <value caption="Memory below 0x5400 address is write-protected" name="PWP21K" value="0x3ea" />
         <value caption="Memory below 0x5800 address is write-protected" name="PWP22K" value="0x3e9" />
         <value caption="Memory below 0x5C00 address is write-protected" name="PWP23K" value="0x3e8" />
         <value caption="Memory below 0x6000 address is write-protected" name="PWP24K" value="0x3e7" />
         <value caption="Memory below 0x6400 address is write-protected" name="PWP25K" value="0x3e6" />
         <value caption="Memory below 0x6800 address is write-protected" name="PWP26K" value="0x3e5" />
         <value caption="Memory below 0x6C00 address is write-protected" name="PWP27K" value="0x3e4" />
         <value caption="Memory below 0x7000 address is write-protected" name="PWP28K" value="0x3e3" />
         <value caption="Memory below 0x7400 address is write-protected" name="PWP29K" value="0x3e2" />
         <value caption="Memory below 0x7800 address is write-protected" name="PWP30K" value="0x3e1" />
         <value caption="Memory below 0x7C00 address is write-protected" name="PWP31K" value="0x3e0" />
         <value caption="Memory below 0x8000 address is write-protected" name="PWP32K" value="0x3df" />
         <value caption="Memory below 0x8400 address is write-protected" name="PWP33K" value="0x3de" />
         <value caption="Memory below 0x8800 address is write-protected" name="PWP34K" value="0x3dd" />
         <value caption="Memory below 0x8C00 address is write-protected" name="PWP35K" value="0x3dc" />
         <value caption="Memory below 0x9000 address is write-protected" name="PWP36K" value="0x3db" />
         <value caption="Memory below 0x9400 address is write-protected" name="PWP37K" value="0x3da" />
         <value caption="Memory below 0x9800 address is write-protected" name="PWP38K" value="0x3d9" />
         <value caption="Memory below 0x9C00 address is write-protected" name="PWP39K" value="0x3d8" />
         <value caption="Memory below 0xA000 address is write-protected" name="PWP40K" value="0x3d7" />
         <value caption="Memory below 0xA400 address is write-protected" name="PWP41K" value="0x3d6" />
         <value caption="Memory below 0xA800 address is write-protected" name="PWP42K" value="0x3d5" />
         <value caption="Memory below 0xAC00 address is write-protected" name="PWP43K" value="0x3d4" />
         <value caption="Memory below 0xB000 address is write-protected" name="PWP44K" value="0x3d3" />
         <value caption="Memory below 0xB400 address is write-protected" name="PWP45K" value="0x3d2" />
         <value caption="Memory below 0xB800 address is write-protected" name="PWP46K" value="0x3d1" />
         <value caption="Memory below 0xBC00 address is write-protected" name="PWP47K" value="0x3d0" />
         <value caption="Memory below 0xC000 address is write-protected" name="PWP48K" value="0x3cf" />
         <value caption="Memory below 0xC400 address is write-protected" name="PWP49K" value="0x3ce" />
         <value caption="Memory below 0xC800 address is write-protected" name="PWP50K" value="0x3cd" />
         <value caption="Memory below 0xCC00 address is write-protected" name="PWP51K" value="0x3cc" />
         <value caption="Memory below 0xD000 address is write-protected" name="PWP52K" value="0x3cb" />
         <value caption="Memory below 0xD400 address is write-protected" name="PWP53K" value="0x3ca" />
         <value caption="Memory below 0xD800 address is write-protected" name="PWP54K" value="0x3c9" />
         <value caption="Memory below 0xDC00 address is write-protected" name="PWP55K" value="0x3c8" />
         <value caption="Memory below 0xE000 address is write-protected" name="PWP56K" value="0x3c7" />
         <value caption="Memory below 0xE400 address is write-protected" name="PWP57K" value="0x3c6" />
         <value caption="Memory below 0xE800 address is write-protected" name="PWP58K" value="0x3c5" />
         <value caption="Memory below 0xEC00 address is write-protected" name="PWP59K" value="0x3c4" />
         <value caption="Memory below 0xF000 address is write-protected" name="PWP60K" value="0x3c3" />
         <value caption="Memory below 0xF400 address is write-protected" name="PWP61K" value="0x3c2" />
         <value caption="Memory below 0xF800 address is write-protected" name="PWP62K" value="0x3c1" />
         <value caption="Memory below 0xFC00 address is write-protected" name="PWP63K" value="0x3c0" />
         <value caption="Memory below 0x10000 address is write-protected" name="PWP64K" value="0x3bf" />
         <value caption="Memory below 0x10400 address is write-protected" name="PWP65K" value="0x3be" />
         <value caption="Memory below 0x10800 address is write-protected" name="PWP66K" value="0x3bd" />
         <value caption="Memory below 0x10C00 address is write-protected" name="PWP67K" value="0x3bc" />
         <value caption="Memory below 0x11000 address is write-protected" name="PWP68K" value="0x3bb" />
         <value caption="Memory below 0x11400 address is write-protected" name="PWP69K" value="0x3ba" />
         <value caption="Memory below 0x11800 address is write-protected" name="PWP70K" value="0x3b9" />
         <value caption="Memory below 0x11C00 address is write-protected" name="PWP71K" value="0x3b8" />
         <value caption="Memory below 0x12000 address is write-protected" name="PWP72K" value="0x3b7" />
         <value caption="Memory below 0x12400 address is write-protected" name="PWP73K" value="0x3b6" />
         <value caption="Memory below 0x12800 address is write-protected" name="PWP74K" value="0x3b5" />
         <value caption="Memory below 0x12C00 address is write-protected" name="PWP75K" value="0x3b4" />
         <value caption="Memory below 0x13000 address is write-protected" name="PWP76K" value="0x3b3" />
         <value caption="Memory below 0x13400 address is write-protected" name="PWP77K" value="0x3b2" />
         <value caption="Memory below 0x13800 address is write-protected" name="PWP78K" value="0x3b1" />
         <value caption="Memory below 0x13C00 address is write-protected" name="PWP79K" value="0x3b0" />
         <value caption="Memory below 0x14000 address is write-protected" name="PWP80K" value="0x3af" />
         <value caption="Memory below 0x14400 address is write-protected" name="PWP81K" value="0x3ae" />
         <value caption="Memory below 0x14800 address is write-protected" name="PWP82K" value="0x3ad" />
         <value caption="Memory below 0x14C00 address is write-protected" name="PWP83K" value="0x3ac" />
         <value caption="Memory below 0x15000 address is write-protected" name="PWP84K" value="0x3ab" />
         <value caption="Memory below 0x15400 address is write-protected" name="PWP85K" value="0x3aa" />
         <value caption="Memory below 0x15800 address is write-protected" name="PWP86K" value="0x3a9" />
         <value caption="Memory below 0x15C00 address is write-protected" name="PWP87K" value="0x3a8" />
         <value caption="Memory below 0x16000 address is write-protected" name="PWP88K" value="0x3a7" />
         <value caption="Memory below 0x16400 address is write-protected" name="PWP89K" value="0x3a6" />
         <value caption="Memory below 0x16800 address is write-protected" name="PWP90K" value="0x3a5" />
         <value caption="Memory below 0x16C00 address is write-protected" name="PWP91K" value="0x3a4" />
         <value caption="Memory below 0x17000 address is write-protected" name="PWP92K" value="0x3a3" />
         <value caption="Memory below 0x17400 address is write-protected" name="PWP93K" value="0x3a2" />
         <value caption="Memory below 0x17800 address is write-protected" name="PWP94K" value="0x3a1" />
         <value caption="Memory below 0x17C00 address is write-protected" name="PWP95K" value="0x3a0" />
         <value caption="Memory below 0x18000 address is write-protected" name="PWP96K" value="0x39f" />
         <value caption="Memory below 0x18400 address is write-protected" name="PWP97K" value="0x39e" />
         <value caption="Memory below 0x18800 address is write-protected" name="PWP98K" value="0x39d" />
         <value caption="Memory below 0x18C00 address is write-protected" name="PWP99K" value="0x39c" />
         <value caption="Memory below 0x19000 address is write-protected" name="PWP100K" value="0x39b" />
         <value caption="Memory below 0x19400 address is write-protected" name="PWP101K" value="0x39a" />
         <value caption="Memory below 0x19800 address is write-protected" name="PWP102K" value="0x399" />
         <value caption="Memory below 0x19C00 address is write-protected" name="PWP103K" value="0x398" />
         <value caption="Memory below 0x1A000 address is write-protected" name="PWP104K" value="0x397" />
         <value caption="Memory below 0x1A400 address is write-protected" name="PWP105K" value="0x396" />
         <value caption="Memory below 0x1A800 address is write-protected" name="PWP106K" value="0x395" />
         <value caption="Memory below 0x1AC00 address is write-protected" name="PWP107K" value="0x394" />
         <value caption="Memory below 0x1B000 address is write-protected" name="PWP108K" value="0x393" />
         <value caption="Memory below 0x1B400 address is write-protected" name="PWP109K" value="0x392" />
         <value caption="Memory below 0x1B800 address is write-protected" name="PWP110K" value="0x391" />
         <value caption="Memory below 0x1BC00 address is write-protected" name="PWP111K" value="0x390" />
         <value caption="Memory below 0x1C000 address is write-protected" name="PWP112K" value="0x38f" />
         <value caption="Memory below 0x1C400 address is write-protected" name="PWP113K" value="0x38e" />
         <value caption="Memory below 0x1C800 address is write-protected" name="PWP114K" value="0x38d" />
         <value caption="Memory below 0x1CC00 address is write-protected" name="PWP115K" value="0x38c" />
         <value caption="Memory below 0x1D000 address is write-protected" name="PWP116K" value="0x38b" />
         <value caption="Memory below 0x1D400 address is write-protected" name="PWP117K" value="0x38a" />
         <value caption="Memory below 0x1D800 address is write-protected" name="PWP118K" value="0x389" />
         <value caption="Memory below 0x1DC00 address is write-protected" name="PWP119K" value="0x388" />
         <value caption="Memory below 0x1E000 address is write-protected" name="PWP120K" value="0x387" />
         <value caption="Memory below 0x1E400 address is write-protected" name="PWP121K" value="0x386" />
         <value caption="Memory below 0x1E800 address is write-protected" name="PWP122K" value="0x385" />
         <value caption="Memory below 0x1EC00 address is write-protected" name="PWP123K" value="0x384" />
         <value caption="Memory below 0x1F000 address is write-protected" name="PWP124K" value="0x383" />
         <value caption="Memory below 0x1F400 address is write-protected" name="PWP125K" value="0x382" />
         <value caption="Memory below 0x1F800 address is write-protected" name="PWP126K" value="0x381" />
         <value caption="Memory below 0x1FC00 address is write-protected" name="PWP127K" value="0x380" />
         <value caption="Memory below 0x20000 address is write-protected" name="PWP128K" value="0x37f" />
         <value caption="Memory below 0x20400 address is write-protected" name="PWP129K" value="0x37e" />
         <value caption="Memory below 0x20800 address is write-protected" name="PWP130K" value="0x37d" />
         <value caption="Memory below 0x20C00 address is write-protected" name="PWP131K" value="0x37c" />
         <value caption="Memory below 0x21000 address is write-protected" name="PWP132K" value="0x37b" />
         <value caption="Memory below 0x21400 address is write-protected" name="PWP133K" value="0x37a" />
         <value caption="Memory below 0x21800 address is write-protected" name="PWP134K" value="0x379" />
         <value caption="Memory below 0x21C00 address is write-protected" name="PWP135K" value="0x378" />
         <value caption="Memory below 0x22000 address is write-protected" name="PWP136K" value="0x377" />
         <value caption="Memory below 0x22400 address is write-protected" name="PWP137K" value="0x376" />
         <value caption="Memory below 0x22800 address is write-protected" name="PWP138K" value="0x375" />
         <value caption="Memory below 0x22C00 address is write-protected" name="PWP139K" value="0x374" />
         <value caption="Memory below 0x23000 address is write-protected" name="PWP140K" value="0x373" />
         <value caption="Memory below 0x23400 address is write-protected" name="PWP141K" value="0x372" />
         <value caption="Memory below 0x23800 address is write-protected" name="PWP142K" value="0x371" />
         <value caption="Memory below 0x23C00 address is write-protected" name="PWP143K" value="0x370" />
         <value caption="Memory below 0x24000 address is write-protected" name="PWP144K" value="0x36f" />
         <value caption="Memory below 0x24400 address is write-protected" name="PWP145K" value="0x36e" />
         <value caption="Memory below 0x24800 address is write-protected" name="PWP146K" value="0x36d" />
         <value caption="Memory below 0x24C00 address is write-protected" name="PWP147K" value="0x36c" />
         <value caption="Memory below 0x25000 address is write-protected" name="PWP148K" value="0x36b" />
         <value caption="Memory below 0x25400 address is write-protected" name="PWP149K" value="0x36a" />
         <value caption="Memory below 0x25800 address is write-protected" name="PWP150K" value="0x369" />
         <value caption="Memory below 0x25C00 address is write-protected" name="PWP151K" value="0x368" />
         <value caption="Memory below 0x26000 address is write-protected" name="PWP152K" value="0x367" />
         <value caption="Memory below 0x26400 address is write-protected" name="PWP153K" value="0x366" />
         <value caption="Memory below 0x26800 address is write-protected" name="PWP154K" value="0x365" />
         <value caption="Memory below 0x26C00 address is write-protected" name="PWP155K" value="0x364" />
         <value caption="Memory below 0x27000 address is write-protected" name="PWP156K" value="0x363" />
         <value caption="Memory below 0x27400 address is write-protected" name="PWP157K" value="0x362" />
         <value caption="Memory below 0x27800 address is write-protected" name="PWP158K" value="0x361" />
         <value caption="Memory below 0x27C00 address is write-protected" name="PWP159K" value="0x360" />
         <value caption="Memory below 0x28000 address is write-protected" name="PWP160K" value="0x35f" />
         <value caption="Memory below 0x28400 address is write-protected" name="PWP161K" value="0x35e" />
         <value caption="Memory below 0x28800 address is write-protected" name="PWP162K" value="0x35d" />
         <value caption="Memory below 0x28C00 address is write-protected" name="PWP163K" value="0x35c" />
         <value caption="Memory below 0x29000 address is write-protected" name="PWP164K" value="0x35b" />
         <value caption="Memory below 0x29400 address is write-protected" name="PWP165K" value="0x35a" />
         <value caption="Memory below 0x29800 address is write-protected" name="PWP166K" value="0x359" />
         <value caption="Memory below 0x29C00 address is write-protected" name="PWP167K" value="0x358" />
         <value caption="Memory below 0x2A000 address is write-protected" name="PWP168K" value="0x357" />
         <value caption="Memory below 0x2A400 address is write-protected" name="PWP169K" value="0x356" />
         <value caption="Memory below 0x2A800 address is write-protected" name="PWP170K" value="0x355" />
         <value caption="Memory below 0x2AC00 address is write-protected" name="PWP171K" value="0x354" />
         <value caption="Memory below 0x2B000 address is write-protected" name="PWP172K" value="0x353" />
         <value caption="Memory below 0x2B400 address is write-protected" name="PWP173K" value="0x352" />
         <value caption="Memory below 0x2B800 address is write-protected" name="PWP174K" value="0x351" />
         <value caption="Memory below 0x2BC00 address is write-protected" name="PWP175K" value="0x350" />
         <value caption="Memory below 0x2C000 address is write-protected" name="PWP176K" value="0x34f" />
         <value caption="Memory below 0x2C400 address is write-protected" name="PWP177K" value="0x34e" />
         <value caption="Memory below 0x2C800 address is write-protected" name="PWP178K" value="0x34d" />
         <value caption="Memory below 0x2CC00 address is write-protected" name="PWP179K" value="0x34c" />
         <value caption="Memory below 0x2D000 address is write-protected" name="PWP180K" value="0x34b" />
         <value caption="Memory below 0x2D400 address is write-protected" name="PWP181K" value="0x34a" />
         <value caption="Memory below 0x2D800 address is write-protected" name="PWP182K" value="0x349" />
         <value caption="Memory below 0x2DC00 address is write-protected" name="PWP183K" value="0x348" />
         <value caption="Memory below 0x2E000 address is write-protected" name="PWP184K" value="0x347" />
         <value caption="Memory below 0x2E400 address is write-protected" name="PWP185K" value="0x346" />
         <value caption="Memory below 0x2E800 address is write-protected" name="PWP186K" value="0x345" />
         <value caption="Memory below 0x2EC00 address is write-protected" name="PWP187K" value="0x344" />
         <value caption="Memory below 0x2F000 address is write-protected" name="PWP188K" value="0x343" />
         <value caption="Memory below 0x2F400 address is write-protected" name="PWP189K" value="0x342" />
         <value caption="Memory below 0x2F800 address is write-protected" name="PWP190K" value="0x341" />
         <value caption="Memory below 0x2FC00 address is write-protected" name="PWP191K" value="0x340" />
         <value caption="Memory below 0x30000 address is write-protected" name="PWP192K" value="0x33f" />
         <value caption="Memory below 0x30400 address is write-protected" name="PWP193K" value="0x33e" />
         <value caption="Memory below 0x30800 address is write-protected" name="PWP194K" value="0x33d" />
         <value caption="Memory below 0x30C00 address is write-protected" name="PWP195K" value="0x33c" />
         <value caption="Memory below 0x31000 address is write-protected" name="PWP196K" value="0x33b" />
         <value caption="Memory below 0x31400 address is write-protected" name="PWP197K" value="0x33a" />
         <value caption="Memory below 0x31800 address is write-protected" name="PWP198K" value="0x339" />
         <value caption="Memory below 0x31C00 address is write-protected" name="PWP199K" value="0x338" />
         <value caption="Memory below 0x32000 address is write-protected" name="PWP200K" value="0x337" />
         <value caption="Memory below 0x32400 address is write-protected" name="PWP201K" value="0x336" />
         <value caption="Memory below 0x32800 address is write-protected" name="PWP202K" value="0x335" />
         <value caption="Memory below 0x32C00 address is write-protected" name="PWP203K" value="0x334" />
         <value caption="Memory below 0x33000 address is write-protected" name="PWP204K" value="0x333" />
         <value caption="Memory below 0x33400 address is write-protected" name="PWP205K" value="0x332" />
         <value caption="Memory below 0x33800 address is write-protected" name="PWP206K" value="0x331" />
         <value caption="Memory below 0x33C00 address is write-protected" name="PWP207K" value="0x330" />
         <value caption="Memory below 0x34000 address is write-protected" name="PWP208K" value="0x32f" />
         <value caption="Memory below 0x34400 address is write-protected" name="PWP209K" value="0x32e" />
         <value caption="Memory below 0x34800 address is write-protected" name="PWP210K" value="0x32d" />
         <value caption="Memory below 0x34C00 address is write-protected" name="PWP211K" value="0x32c" />
         <value caption="Memory below 0x35000 address is write-protected" name="PWP212K" value="0x32b" />
         <value caption="Memory below 0x35400 address is write-protected" name="PWP213K" value="0x32a" />
         <value caption="Memory below 0x35800 address is write-protected" name="PWP214K" value="0x329" />
         <value caption="Memory below 0x35C00 address is write-protected" name="PWP215K" value="0x328" />
         <value caption="Memory below 0x36000 address is write-protected" name="PWP216K" value="0x327" />
         <value caption="Memory below 0x36400 address is write-protected" name="PWP217K" value="0x326" />
         <value caption="Memory below 0x36800 address is write-protected" name="PWP218K" value="0x325" />
         <value caption="Memory below 0x36C00 address is write-protected" name="PWP219K" value="0x324" />
         <value caption="Memory below 0x37000 address is write-protected" name="PWP220K" value="0x323" />
