MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128L.atdf
         <value caption="Memory below 0x6FC00 address is write-protected" name="PWP447K" value="0x240" />
         <value caption="Memory below 0x70000 address is write-protected" name="PWP448K" value="0x23f" />
         <value caption="Memory below 0x70400 address is write-protected" name="PWP449K" value="0x23e" />
         <value caption="Memory below 0x70800 address is write-protected" name="PWP450K" value="0x23d" />
         <value caption="Memory below 0x70C00 address is write-protected" name="PWP451K" value="0x23c" />
         <value caption="Memory below 0x71000 address is write-protected" name="PWP452K" value="0x23b" />
         <value caption="Memory below 0x71400 address is write-protected" name="PWP453K" value="0x23a" />
         <value caption="Memory below 0x71800 address is write-protected" name="PWP454K" value="0x239" />
         <value caption="Memory below 0x71C00 address is write-protected" name="PWP455K" value="0x238" />
         <value caption="Memory below 0x72000 address is write-protected" name="PWP456K" value="0x237" />
         <value caption="Memory below 0x72400 address is write-protected" name="PWP457K" value="0x236" />
         <value caption="Memory below 0x72800 address is write-protected" name="PWP458K" value="0x235" />
         <value caption="Memory below 0x72C00 address is write-protected" name="PWP459K" value="0x234" />
         <value caption="Memory below 0x73000 address is write-protected" name="PWP460K" value="0x233" />
         <value caption="Memory below 0x73400 address is write-protected" name="PWP461K" value="0x232" />
         <value caption="Memory below 0x73800 address is write-protected" name="PWP462K" value="0x231" />
         <value caption="Memory below 0x73C00 address is write-protected" name="PWP463K" value="0x230" />
         <value caption="Memory below 0x74000 address is write-protected" name="PWP464K" value="0x22f" />
         <value caption="Memory below 0x74400 address is write-protected" name="PWP465K" value="0x22e" />
         <value caption="Memory below 0x74800 address is write-protected" name="PWP466K" value="0x22d" />
         <value caption="Memory below 0x74C00 address is write-protected" name="PWP467K" value="0x22c" />
         <value caption="Memory below 0x75000 address is write-protected" name="PWP468K" value="0x22b" />
         <value caption="Memory below 0x75400 address is write-protected" name="PWP469K" value="0x22a" />
         <value caption="Memory below 0x75800 address is write-protected" name="PWP470K" value="0x229" />
         <value caption="Memory below 0x75C00 address is write-protected" name="PWP471K" value="0x228" />
         <value caption="Memory below 0x76000 address is write-protected" name="PWP472K" value="0x227" />
         <value caption="Memory below 0x76400 address is write-protected" name="PWP473K" value="0x226" />
         <value caption="Memory below 0x76800 address is write-protected" name="PWP474K" value="0x225" />
         <value caption="Memory below 0x76C00 address is write-protected" name="PWP475K" value="0x224" />
         <value caption="Memory below 0x77000 address is write-protected" name="PWP476K" value="0x223" />
         <value caption="Memory below 0x77400 address is write-protected" name="PWP477K" value="0x222" />
         <value caption="Memory below 0x77800 address is write-protected" name="PWP478K" value="0x221" />
         <value caption="Memory below 0x77C00 address is write-protected" name="PWP479K" value="0x220" />
         <value caption="Memory below 0x78000 address is write-protected" name="PWP480K" value="0x21f" />
         <value caption="Memory below 0x78400 address is write-protected" name="PWP481K" value="0x21e" />
         <value caption="Memory below 0x78800 address is write-protected" name="PWP482K" value="0x21d" />
         <value caption="Memory below 0x78C00 address is write-protected" name="PWP483K" value="0x21c" />
         <value caption="Memory below 0x79000 address is write-protected" name="PWP484K" value="0x21b" />
         <value caption="Memory below 0x79400 address is write-protected" name="PWP485K" value="0x21a" />
         <value caption="Memory below 0x79800 address is write-protected" name="PWP486K" value="0x219" />
         <value caption="Memory below 0x79C00 address is write-protected" name="PWP487K" value="0x218" />
         <value caption="Memory below 0x7A000 address is write-protected" name="PWP488K" value="0x217" />
         <value caption="Memory below 0x7A400 address is write-protected" name="PWP489K" value="0x216" />
         <value caption="Memory below 0x7A800 address is write-protected" name="PWP490K" value="0x215" />
         <value caption="Memory below 0x7AC00 address is write-protected" name="PWP491K" value="0x214" />
         <value caption="Memory below 0x7B000 address is write-protected" name="PWP492K" value="0x213" />
         <value caption="Memory below 0x7B400 address is write-protected" name="PWP493K" value="0x212" />
         <value caption="Memory below 0x7B800 address is write-protected" name="PWP494K" value="0x211" />
         <value caption="Memory below 0x7BC00 address is write-protected" name="PWP495K" value="0x210" />
         <value caption="Memory below 0x7C000 address is write-protected" name="PWP496K" value="0x20f" />
         <value caption="Memory below 0x7C400 address is write-protected" name="PWP497K" value="0x20e" />
         <value caption="Memory below 0x7C800 address is write-protected" name="PWP498K" value="0x20d" />
         <value caption="Memory below 0x7CC00 address is write-protected" name="PWP499K" value="0x20c" />
         <value caption="Memory below 0x7D000 address is write-protected" name="PWP500K" value="0x20b" />
         <value caption="Memory below 0x7D400 address is write-protected" name="PWP501K" value="0x20a" />
         <value caption="Memory below 0x7D800 address is write-protected" name="PWP502K" value="0x209" />
         <value caption="Memory below 0x7DC00 address is write-protected" name="PWP503K" value="0x208" />
         <value caption="Memory below 0x7E000 address is write-protected" name="PWP504K" value="0x207" />
         <value caption="Memory below 0x7E400 address is write-protected" name="PWP505K" value="0x206" />
         <value caption="Memory below 0x7E800 address is write-protected" name="PWP506K" value="0x205" />
         <value caption="Memory below 0x7EC00 address is write-protected" name="PWP507K" value="0x204" />
         <value caption="Memory below 0x7F000 address is write-protected" name="PWP508K" value="0x203" />
         <value caption="Memory below 0x7F400 address is write-protected" name="PWP509K" value="0x202" />
         <value caption="Memory below 0x7F800 address is write-protected" name="PWP510K" value="0x201" />
         <value caption="Memory below 0x7FC00 address is write-protected" name="PWP511K" value="0x200" />
         <value caption="Memory below 0x80000 address is write-protected" name="PWP512K" value="0x1ff" />
      </value-group>
      <value-group caption="Boot Flash Write-Protect bit" name="DEVCFG0__BWP">
         <value caption="Boot Flash is writable" name="OFF" value="0x1" />
         <value caption="Boot Flash is not writable" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCFG0__CP">
         <value caption="Protection is enabled" name="ON" value="0x0" />
         <value caption="Protection is disabled" name="OFF" value="0x1" />
      </value-group>
   </module>
