MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128L.atdf
      <value-group caption="Timer On bit" name="T5CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00734" name="UART" version="1">
      <register-group name="UART">
         <register caption="UARTx Mode Register" name="U1MODE" offset="0x0" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U1MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U1MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U1MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U1MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U1MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U1MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U1MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U1MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U1MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U1MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U1MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U1MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U2MODE" offset="0x200" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U2MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U2MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U2MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U2MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U2MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U2MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U2MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U2MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U2MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U2MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U2MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U2MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U3MODE" offset="0x400" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U3MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U3MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U3MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U3MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U3MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U3MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U3MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U3MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U3MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U3MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U3MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U3MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U4MODE" offset="0x600" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U4MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U4MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U4MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U4MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U4MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U4MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U4MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U4MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U4MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U4MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U4MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U4MODE__ON" />
         </register>
