MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128L.atdf
      <value-group caption="Token Processing Complete Interrupt Enable bit" name="U1IE__TRNIE">
         <value caption="TRNIF interrupt is enabled" name="" value="0x1" />
         <value caption="TRNIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Idle Detect Interrupt Enable bit" name="U1IE__IDLEIE">
         <value caption="Idle interrupt is enabled" name="" value="0x1" />
         <value caption="Idle interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RESUME Interrupt Enable bit" name="U1IE__RESUMEIE">
         <value caption="RESUME interrupt is enabled" name="" value="0x1" />
         <value caption="RESUME interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ATTACH Interrupt Enable bit" name="U1IE__ATTACHIE">
         <value caption="ATTACH interrupt is enabled" name="" value="0x1" />
         <value caption="ATTACH interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Interrupt Enable bit" name="U1IE__STALLIE">
         <value caption="STALL interrupt is enabled" name="" value="0x1" />
         <value caption="STALL interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Detach Interrupt Enable bit" name="U1IE__DETACHIE">
         <value caption="DATTCHIF interrupt is enabled" name="" value="0x1" />
         <value caption="DATTCHIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Reset Interrupt Enable bit" name="U1IE__URSTIE">
         <value caption="URSTIF interrupt is enabled" name="" value="0x1" />
         <value caption="URSTIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Flag bit" name="U1EIR__PIDEF">
         <value caption="PID check is failed" name="" value="0x1" />
         <value caption="PID check is passed" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Flag bit" name="U1EIR__CRC16EF">
         <value caption="Data packet rejected due to CRC16 error" name="" value="0x1" />
         <value caption="Data packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Flag bit" name="U1EIR__DFN8EF">
         <value caption="Data field received is not an integral number of bytes" name="" value="0x1" />
         <value caption="Data field received is an integral number of bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-Out Error Flag bit" name="U1EIR__BTOEF">
         <value caption="Bus turnaround time-out has occurred" name="" value="0x1" />
         <value caption="No bus turnaround time-out" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Flag bit" name="U1EIR__DMAEF">
         <value caption="USB DMA error condition detected" name="" value="0x1" />
         <value caption="No DMA error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Flag bit" name="U1EIR__BMXEF">
         <value caption="The base address, of the BDT, or the address of an individual buffer pointed to by a BDT entry, i s invalid" name="" value="0x1" />
         <value caption="No address error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Flag bit" name="U1EIR__BTSEF">
         <value caption="Packet is rejected due to bit stuff error" name="" value="0x1" />
         <value caption="Packet is accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC5 Host Error Flag bit" name="U1EIR__CRC5EF">
         <value caption="Token packet is rejected due to CRC5 error" name="" value="0x2" />
         <value caption="Token packet is accepted" name="" value="0x0" />
         <value caption="EOF error condition is detected" name="" value="0x2" />
         <value caption="No EOF error condition" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Interrupt Enable bit" name="U1EIE__PIDEE">
         <value caption="PIDEF interrupt is enabled" name="" value="0x1" />
         <value caption="PIDEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Interrupt Enable bit" name="U1EIE__CRC16EE">
         <value caption="CRC16EF interrupt is enabled" name="" value="0x1" />
         <value caption="CRC16EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Interrupt Enable bit" name="U1EIE__DFN8EE">
         <value caption="DFN8EF interrupt is enabled" name="" value="0x1" />
         <value caption="DFN8EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-out Error Interrupt Enable bit" name="U1EIE__BTOEE">
         <value caption="BTOEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTOEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Interrupt Enable bit" name="U1EIE__DMAEE">
         <value caption="DMAEF interrupt is enabled" name="" value="0x1" />
         <value caption="DMAEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Interrupt Enable bit" name="U1EIE__BMXEE">
         <value caption="BMXEF interrupt is enabled" name="" value="0x1" />
         <value caption="BMXEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Interrupt Enable bit" name="U1EIE__BTSEE">
         <value caption="BTSEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTSEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC5 Host Error Interrupt Enable bit" name="U1EIE__CRC5EE">
         <value caption="CRC5EF interrupt is enabled" name="" value="0x2" />
         <value caption="CRC5EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong BD Pointer Indicator bit" name="U1STAT__PPBI">
         <value caption="The last transaction was to the ODD BD bank" name="" value="0x1" />
         <value caption="The last transaction was to the EVEN BD bank" name="" value="0x0" />
      </value-group>
      <value-group caption="Last BD Direction Indicator bit" name="U1STAT__DIR">
         <value caption="Last transaction was a transmit transfer (TX)" name="" value="0x1" />
         <value caption="Last transaction was a receive transfer (RX)" name="" value="0x0" />
      </value-group>
      <value-group caption="Encoded Number of Last Endpoint Activity bits" name="U1STAT__ENDPT">
         <value caption="Endpoint 15" name="" value="0xf" />
         <value caption="Endpoint 14" name="" value="0xe" />
         <value caption="Endpoint 13" name="" value="0xd" />
         <value caption="Endpoint 12" name="" value="0xc" />
         <value caption="Endpoint 11" name="" value="0xb" />
         <value caption="Endpoint 10" name="" value="0xa" />
         <value caption="Endpoint 9" name="" value="0x9" />
         <value caption="Endpoint 8" name="" value="0x8" />
         <value caption="Endpoint 7" name="" value="0x7" />
         <value caption="Endpoint 6" name="" value="0x6" />
         <value caption="Endpoint 5" name="" value="0x5" />
         <value caption="Endpoint 4" name="" value="0x4" />
         <value caption="Endpoint 3" name="" value="0x3" />
         <value caption="Endpoint 2" name="" value="0x2" />
         <value caption="Endpoint 1" name="" value="0x1" />
         <value caption="Endpoint 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong Buffers Reset bit" name="U1CON__PPBRST">
         <value caption="Reset all Even/Odd buffer pointers to the EVEN BD banks" name="" value="0x1" />
         <value caption="Even/Odd buffer pointers not being Reset" name="" value="0x0" />
      </value-group>
